In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('Average_Salary_by_Job_Classification.csv')
df_2 = pd.read_csv('controlledexperiment.csv')

In [3]:
# Cleaned Dataframe
df = df.replace({'\$': ''}, regex=True) 
df = df.replace({'\,': ''}, regex=True) 
df['Average of Base Salary'] = df['Average of Base Salary'].astype(float)
df['Grade'] = pd.to_numeric(df['Grade'], errors='coerce')
df = df.dropna()
df['Grade'] = df['Grade'].astype(int)
df.head()

<>:2: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\,'
<>:2: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\,'
/var/folders/9q/rmwtnl614cz0kwkv_mbv5h780000gn/T/ipykernel_46655/3830997709.py:2: SyntaxWarning: invalid escape sequence '\$'
  df = df.replace({'\$': ''}, regex=True)
/var/folders/9q/rmwtnl614cz0kwkv_mbv5h780000gn/T/ipykernel_46655/3830997709.py:3: SyntaxWarning: invalid escape sequence '\,'
  df = df.replace({'\,': ''}, regex=True)

,Position Title,Position Class Code,Grade,Average of Base Salary,Number of Employees
0,Information Technology Expert,550,32,146925.34,9
1,Accountant/Auditor II,210,21,82742.44,2
2,Veterinary Assistant,206513,15,45925.44,2
3,Police Aide,3506,15,58628.63,15
4,ERP Functional Business Analyst,100546,30,133797.25,3

In [4]:
# Random Sampling
random_indices = np.random.uniform(0, len(df), 35).astype(int)
df = df.iloc[random_indices]

In [19]:
#Sample Means - Does having a higher salary mean that your job is a higher grade? 
#Base Salary 
y_bar = round(df['Average of Base Salary'].sum()/len(df),2)
y_bar

np.float64(86615.79)

In [18]:
#Grade
x_bar = round(df['Grade'].sum()/len(df),2)
x_bar

np.float64(21.63)

In [13]:
#Covariance Calculation 
summation = 0
for x, y in zip(df['Grade'], df['Average of Base Salary']):
    summation += (x - x_bar) * (y - y_bar)

covariance = summation / (len(df) - 1)
print(covariance)

137359.11166764703

In [20]:
# Question 1 Covariance and Mean Calculations 
# Social Media Use
x_bar2 = round(df_2['X'].sum()/len(df_2),2) 
# How productive they feel 
y_bar2 = round(df_2['Y'].sum()/len(df_2),2)
summation1 = 0
for x, y in zip(df_2['X'], df_2['Y']):
    summation1 += (x - x_bar2) * (y - y_bar2)

covariance = summation1 / (len(df_2) - 1)
print(covariance)

-0.7499999999999996

In [21]:
x_bar2

np.float64(3.66)